# development
cask "arc"
cask "figma"
cask "docker"
cask "postman"
cask "ghostty"
cask "raycast"
cask "openlens"
cask "google-chrome"
cask "visual-studio-code"
vscode "enkia.tokyo-night" 
vscode "ms-vscode-remote.remote-containers"
vscode "docker.docker"
vscode "github.copilot"
vscode "vscodevim.vim"
vscode "mhutchie.git-graph"
vscode "waderyan.gitblame"
vscode "pkief.material-icon-theme"
vscode "github.vscode-github-actions"